perf/test/quote-spike.yaml
config:
  environments:
    base:
      target: 'http://localhost:3000/base'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
    cache:
      target: 'http://localhost:3000/cache'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

    replication:
      target: 'http://localhost:3000/replication'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
    
    rateLimiting: 
      target: 'http://localhost:3000/rate-limiting'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: start
      duration: 10
      arrivalRate: 3
    - name: spike
      duration: 5
      arrivalRate: 30
    - name: end
      duration: 10
      arrivalRate: 3
    

scenarios:
  - name: Quote
    flow:
      - get:
          url: '/quote'